Repository: vein-cyber/ghostty-cn
Catalog: macos/Sources/App/macOS/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Configuration saved and reloaded.
zh_hans: 配置已保存并重新加载。

source: Continue
zh_hans: 继续

source: Could not create the configuration backup: %@
zh_hans: 无法创建配置备份：%@

source: Could not save the configuration: %@
zh_hans: 无法保存配置：%@

source: GhosttyCN Settings
zh_hans: GhosttyCN 设置

source: GhosttyCN will create a backup, preserve comments and unsupported options, and move supported settings into an automatically managed section.
zh_hans: GhosttyCN 将先创建备份，保留注释和不受支持的选项，并把受支持的设置移入自动管理的区域。

source: Let Visual Settings Manage Your Configuration?
zh_hans: 要让可视化设置管理配置吗？

source: Reinstall GhosttyCN and try again.
zh_hans: 请重新安装 GhosttyCN 后再试。

source: Saving was cancelled.
zh_hans: 已取消保存。

source: Settings resources are missing.
zh_hans: 设置资源缺失。

source: The configuration path is unavailable.
zh_hans: 无法获取配置文件路径。

source: The generated configuration is too large.
zh_hans: 生成的配置过大。

source: The settings data is invalid.
zh_hans: 设置数据无效。

source: The settings editor returned an invalid configuration key.
zh_hans: 设置编辑器返回了无效的配置键。

source: The settings editor returned an invalid line: %@
zh_hans: 设置编辑器返回了无效的配置行：%@

source: %u percent complete
zh_hans: 已完成 %u%%

source: ^[%lld error(s) were](inflect: true) found while loading the configuration. Please review the errors below and reload your configuration or ignore the erroneous lines.
zh_hans: 加载配置时发现 %lld 个错误。请查看下方错误，然后重新加载配置，或忽略出错的行。

source: A key press or release.
zh_hans: 按键的按下或松开操作。

source: A key sequence is a series of key presses that trigger an action. A pending key sequence is currently active.
zh_hans: 按键序列是用于触发操作的一系列按键。当前有一个待完成的按键序列处于活动状态。

source: A key table is a named set of keybindings, activated by some other key. Keys are interpreted using this table until it is deactivated.
zh_hans: 按键表是一组有名称的快捷键绑定，由另一个按键激活。在停用之前，所有按键都将按此表解释。

source: Action
zh_hans: 操作

source: All terminal sessions in this window will be terminated.
zh_hans: 窗口内所有运行中的进程将被终止。

source: All terminal sessions will be terminated.
zh_hans: 终端内所有运行中的进程将被终止。

source: Allow
zh_hans: 允许

source: Allow GhosttyCN to execute "%@"?
zh_hans: 允许 GhosttyCN 执行“%@”吗？

source: Allow Shortcuts to interact with GhosttyCN?
zh_hans: 允许“快捷指令”与 GhosttyCN 交互吗？

source: An error occurred during the update process
zh_hans: 更新过程中发生错误

source: At least one other tab still has a running process. If you close the tab the process will be killed.
zh_hans: 至少有一个其他标签页仍有进程在运行。关闭标签页将终止该进程。

source: At least one tab to the right still has a running process. If you close the tab the process will be killed.
zh_hans: 右侧至少有一个标签页仍有进程在运行。关闭标签页将终止该进程。

source: Authorize Clipboard Access
zh_hans: 剪贴板访问授权

source: Backslash (\)
zh_hans: 反斜杠 (\)

source: Backspace
zh_hans: 退格键

source: Backtick (`)
zh_hans: 反引号 (`)

source: Based on Ghostty
zh_hans: 基于 Ghostty

source: Began
zh_hans: 已开始

source: Blue
zh_hans: 蓝色

source: Bottom pane
zh_hans: 下方窗格

source: Button
zh_hans: 按钮

source: Build
zh_hans: 构建版本

source: Cancel
zh_hans: 取消

source: Cancel or Skip Update
zh_hans: 取消或跳过更新

source: Cancelled
zh_hans: 已取消

source: Cannot Create New Tab
zh_hans: 无法新建标签页

source: Caps Lock
zh_hans: 大写锁定键

source: Change Tab Title
zh_hans: 更改标签页标题

source: Change Tab Title…
zh_hans: 更改标签页标题…

source: Change Terminal Title
zh_hans: 更改终端标题

source: Change Terminal Title…
zh_hans: 更改终端标题…

source: Changed
zh_hans: 已更改

source: Changes Since This Tip Release
zh_hans: 此 Tip 版本以来的更改

source: Checking for updates…
zh_hans: 正在检查更新…

source: Checking for Updates…
zh_hans: 正在检查更新…

source: Click to cycle through icon variants
zh_hans: 点按以循环切换图标样式

source: Close
zh_hans: 关闭

source: Close All Windows
zh_hans: 关闭所有窗口

source: Close All Windows?
zh_hans: 关闭所有窗口吗？

source: Close an existing terminal.
zh_hans: 关闭现有终端。

source: Close Other Tabs
zh_hans: 关闭其他标签页

source: Close Other Tabs?
zh_hans: 关闭其他标签页吗？

source: Close Tab
zh_hans: 关闭标签页

source: Close Tab?
zh_hans: 关闭标签页吗？

source: Close Tabs on the Right?
zh_hans: 关闭右侧标签页吗？

source: Close Tabs to the Right
zh_hans: 关闭右侧标签页

source: Close Terminal
zh_hans: 关闭终端

source: Close Terminal?
zh_hans: 关闭终端吗？

source: Close Window
zh_hans: 关闭窗口

source: Close Window?
zh_hans: 关闭窗口吗？

source: Coming Soon. 🚧
zh_hans: 即将推出。🚧

source: Comma (,)
zh_hans: 逗号 (,)

source: Command
zh_hans: 命令

source: Commit
zh_hans: 提交

source: Command Failed
zh_hans: 命令执行失败

source: Command Finished
zh_hans: 命令已完成

source: Command Palette Command
zh_hans: 命令面板命令

source: Command Succeeded
zh_hans: 命令执行成功

source: Command to execute within your configured shell.
zh_hans: 要在已配置的 Shell 中执行的命令。

# Command took %@ and exited with code %d.
source: Command took %1$@ and exited with code %2$d.
zh_hans: 命令耗时 %1$@，退出代码为 %2$d。

source: Command took %@.
zh_hans: 命令耗时 %@。

source: Configure automatic update preferences
zh_hans: 配置自动更新偏好设置

source: Context Menu
zh_hans: 上下文菜单

source: Control
zh_hans: Control 键

source: Copy
zh_hans: 复制

source: Copy Icon Config
zh_hans: 复制图标配置

source: Copy Link
zh_hans: 复制链接

source: Create a new terminal.
zh_hans: 新建终端。

source: Debug build warning
zh_hans: 调试版本警告

source: Debug builds of GhosttyCN are very slow and you may experience performance problems. Debug builds are only recommended during development.
zh_hans: GhosttyCN 的调试版本运行很慢，可能会出现性能问题。 调试版本仅建议用于开发。

source: Delete
zh_hans: 删除键

source: Deny
zh_hans: 拒绝

source: Description
zh_hans: 说明

source: Detail
zh_hans: 详细信息

source: Disable
zh_hans: 停用

source: Dismiss the current update process
zh_hans: 关闭当前更新流程

source: Docs
zh_hans: 文档

source: Don't Allow
zh_hans: 不允许

source: Down Arrow
zh_hans: 下箭头键

source: Download and install the latest version
zh_hans: 下载并安装最新版本

source: Downloading the update package
zh_hans: 正在下载更新包

source: Downloading Update
zh_hans: 正在下载更新

source: Downloading: %.0f%%
zh_hans: 正在下载：%.0f%%

source: Downloading: 100%
zh_hans: 正在下载：100%

source: Downloading…
zh_hans: 正在下载…

source: Drag to resize the left and right panes
zh_hans: 拖移以调整左右窗格的大小

source: Drag to resize the top and bottom panes
zh_hans: 拖移以调整上下窗格的大小

source: Enable automatic updates?
zh_hans: 启用自动更新吗？

source: Enable Automatic Updates?
zh_hans: 启用自动更新吗？

source: Enable window decorations to use tabs
zh_hans: 启用窗口装饰后才能使用标签页

source: End
zh_hans: End 键

source: Ended
zh_hans: 已结束

source: Enter
zh_hans: 回车键

source: Environment Variables
zh_hans: 环境变量

source: Environment variables in `KEY=VALUE` format.
zh_hans: 采用 `KEY=VALUE` 格式的环境变量。

source: Equal (=)
zh_hans: 等号 (=)

source: Escape
zh_hans: Esc 键

source: Event Type
zh_hans: 事件类型

source: Execute a command…
zh_hans: 选择要执行的命令…

source: Extracting and preparing the update
zh_hans: 正在解压并准备更新

source: Failed to Set Default Terminal
zh_hans: 无法设为默认终端

source: Fast, native, feature-rich terminal emulator pushing modern features.
zh_hans: 快速、原生、功能丰富的终端模拟器， 不断推动现代终端功能发展。

source: Focus Terminal
zh_hans: 聚焦终端

source: Focus: %@
zh_hans: 聚焦：%@

source: Full Contents
zh_hans: 全部内容

source: Get ${detail} from ${terminal}
zh_hans: 从 ${terminal} 获取 ${detail}

source: Get Details of Terminal
zh_hans: 获取终端详细信息

source: GhosttyCN Application Icon
zh_hans: GhosttyCN 应用图标

source: GhosttyCN Blocked This Link
zh_hans: GhosttyCN 已阻止此链接

source: GhosttyCN can automatically check for updates in the background.
zh_hans: GhosttyCN 可以在后台自动检查更新。

source: GhosttyCN could not be set as the default terminal application. Error: %@
zh_hans: 无法将 GhosttyCN 设为默认终端应用。 错误：%@

source: GhosttyCN doesn't allow Shortcuts.
zh_hans: GhosttyCN 不允许“快捷指令”访问。

source: Graphite
zh_hans: 石墨色

source: Green
zh_hans: 绿色

source: High Precision
zh_hans: 高精度

source: Home
zh_hans: Home 键

source: Horizontal split divider
zh_hans: 水平分屏分隔条

source: Horizontal split view
zh_hans: 水平分屏视图

source: If you don't review your windows, any running processes will be terminated
zh_hans: 如果不查看窗口，所有正在运行的进程都将被终止

source: Ignore
zh_hans: 忽略

source: Indeterminate progress
zh_hans: 进度不确定

source: Input Text to Terminal
zh_hans: 向终端输入文本

source: Insert
zh_hans: Insert 键

source: Install and Relaunch
zh_hans: 安装并重新启动

source: Installing update and preparing to restart
zh_hans: 正在安装更新并准备重新启动

source: Installing…
zh_hans: 正在安装…

source: International Backslash
zh_hans: 国际反斜杠键

source: International Ro
zh_hans: 国际 Ro 键

source: International Yen
zh_hans: 国际日元键

source: Invoke a Keybind Action
zh_hans: 调用快捷键操作

source: Invoke Command Palette Action
zh_hans: 调用命令面板操作

source: Key
zh_hans: 按键

source: Key Action
zh_hans: 按键操作

source: Key Sequence
zh_hans: 按键序列

source: Key Table
zh_hans: 按键表

source: Kind
zh_hans: 类型

source: Later
zh_hans: 稍后

source: Leave blank to restore the default.
zh_hans: 留空以恢复默认值。

source: Left
zh_hans: 左键

source: Left Alt
zh_hans: 左 Alt 键

source: Left Arrow
zh_hans: 左箭头键

source: Left Bracket ([)
zh_hans: 左方括号 ([)

source: Left Command
zh_hans: 左 Command 键

source: Left Control
zh_hans: 左 Control 键

source: Left pane
zh_hans: 左侧窗格

source: Left Shift
zh_hans: 左 Shift 键

source: libghostty API call failed
zh_hans: libghostty API 调用失败

source: Loading
zh_hans: 正在载入

source: Location
zh_hans: 位置

source: May Begin
zh_hans: 即将开始

source: Middle
zh_hans: 中键

source: Minus (-)
zh_hans: 减号 (-)

source: Modifier Key
zh_hans: 修饰键

source: Modifier(s)
zh_hans: 修饰键

source: Momentum Phase
zh_hans: 惯性阶段

source: Mouse Button
zh_hans: 鼠标按钮

source: Mouse State
zh_hans: 鼠标状态

source: Move focus to an existing terminal.
zh_hans: 将焦点移到现有终端。

source: Move Split
zh_hans: 移动分屏

source: New Tab
zh_hans: 新建标签页

source: New tabs are unsupported while in non-native fullscreen. Exit fullscreen and try again.
zh_hans: 非原生全屏模式不支持新建标签页。请退出全屏后重试。

source: New Terminal
zh_hans: 新建终端

source: New Window
zh_hans: 新建窗口

source: No matches
zh_hans: 没有匹配项

source: No Updates Available
zh_hans: 没有可用更新

source: No Updates Found
zh_hans: 未找到更新

source: None
zh_hans: 无

source: Normal
zh_hans: 普通

source: Not Now
zh_hans: 暂不

source: Num Lock
zh_hans: 数字锁定键

source: Numpad 0
zh_hans: 小键盘 0

source: Numpad 1
zh_hans: 小键盘 1

source: Numpad 2
zh_hans: 小键盘 2

source: Numpad 3
zh_hans: 小键盘 3

source: Numpad 4
zh_hans: 小键盘 4

source: Numpad 5
zh_hans: 小键盘 5

source: Numpad 6
zh_hans: 小键盘 6

source: Numpad 7
zh_hans: 小键盘 7

source: Numpad 8
zh_hans: 小键盘 8

source: Numpad 9
zh_hans: 小键盘 9

source: Numpad Add (+)
zh_hans: 小键盘加号 (+)

source: Numpad Comma
zh_hans: 小键盘逗号

source: Numpad Decimal
zh_hans: 小键盘小数点

source: Numpad Divide (÷)
zh_hans: 小键盘除号 (÷)

source: Numpad Enter
zh_hans: 小键盘回车键

source: Numpad Equal
zh_hans: 小键盘等号

source: Numpad Multiply (×)
zh_hans: 小键盘乘号 (×)

source: Numpad Subtract (-)
zh_hans: 小键盘减号 (-)

source: Oh, no. 😭
zh_hans: 糟糕。😭

source: OK
zh_hans: 确认

source: Open Link
zh_hans: 打开链接

source: Open Link from Terminal Output?
zh_hans: 打开终端输出中的链接吗？

source: Open the Quick Terminal
zh_hans: 打开快速终端

source: Open the Quick Terminal. If it is already open, then do nothing.
zh_hans: 打开快速终端。如果它已打开，则不执行任何操作。

source: Opening this local target could execute code.
zh_hans: 打开此本地目标可能会执行代码。

source: Operation failed
zh_hans: 操作失败

source: Operation in progress
zh_hans: 操作正在进行

source: Operation paused at completion
zh_hans: 操作已暂停

source: Option
zh_hans: Option 键

source: Orange
zh_hans: 橙色

source: Page Down
zh_hans: Page Down 键

source: Page Up
zh_hans: Page Up 键

source: Parent Terminal
zh_hans: 父终端

source: Paste
zh_hans: 粘贴

source: Period (.)
zh_hans: 句点 (.)

source: Pink
zh_hans: 粉色

source: Please wait while we check for available updates
zh_hans: 请稍候，正在检查可用更新

source: Preparing Update
zh_hans: 正在准备更新

source: Preparing: %.0f%%
zh_hans: 正在准备：%.0f%%

source: Preparing: 100%
zh_hans: 正在准备：100%

source: Press
zh_hans: 按下

source: Process exited after **`%@`**. Press any key to close the terminal.
zh_hans: 进程在 **`%@`** 后退出。按任意键关闭终端。

source: Process exited. Press any key to close the terminal.
zh_hans: 进程已退出。按任意键关闭终端。

source: Purple
zh_hans: 紫色

source: Quick
zh_hans: 快速终端

source: Quit GhosttyCN?
zh_hans: 退出 GhosttyCN 吗？

source: Quote (')
zh_hans: 单引号 (')

source: Read-only
zh_hans: 只读

source: Read-Only Mode
zh_hans: 只读模式

source: Read-only terminal
zh_hans: 只读终端

source: Red
zh_hans: 红色

source: Redo
zh_hans: 重做

source: Redo %@
zh_hans: 重做 %@

source: Release
zh_hans: 松开

source: Released:
zh_hans: 发布日期：

source: Reload Configuration
zh_hans: 重新加载配置

source: Remember my decision for %lld days
zh_hans: 记住我的选择 %lld 天

source: Remember my decision for %lld hours
zh_hans: 记住我的选择 %lld 小时

source: Remember my decision for %lld minutes
zh_hans: 记住我的选择 %lld 分钟

source: Remember my decision for %lld seconds
zh_hans: 记住我的选择 %lld 秒

source: Remember my decision for one day
zh_hans: 记住我的选择 1 天

source: Remember my decision for one hour
zh_hans: 记住我的选择 1 小时

source: Remember my decision for one minute
zh_hans: 记住我的选择 1 分钟

source: Remember my decision for one second
zh_hans: 记住我的选择 1 秒

source: Rename Tab…
zh_hans: 重命名标签页…

source: Repeat
zh_hans: 重复

source: Reset Split Zoom
zh_hans: 重置分屏缩放

source: Reset Terminal
zh_hans: 重置终端

source: Reset Zoom
zh_hans: 重置缩放

source: Restart Later
zh_hans: 稍后重新启动

source: Restart Now
zh_hans: 立即重新启动

source: Restart Required
zh_hans: 需要重新启动

source: Restart to Complete Update
zh_hans: 重新启动以完成更新

source: Retry
zh_hans: 重试

source: Review Windows…
zh_hans: 查看窗口…

source: Right
zh_hans: 右键

source: Right Alt
zh_hans: 右 Alt 键

source: Right Arrow
zh_hans: 右箭头键

source: Right Bracket (])
zh_hans: 右方括号 (])

source: Right Command
zh_hans: 右 Command 键

source: Right Control
zh_hans: 右 Control 键

source: Right pane
zh_hans: 右侧窗格

source: Right Shift
zh_hans: 右 Shift 键

source: Scroll Momentum
zh_hans: 滚动惯性

source: Search
zh_hans: 搜索

source: Secure Input is active. Secure Input is a macOS security feature that prevents applications from reading keyboard events. This is enabled automatically whenever GhosttyCN detects a password prompt in the terminal, or at all times if `GhosttyCN > Secure Keyboard Entry` is active.
zh_hans: 安全输入已启用。安全输入是 macOS 的一项安全功能，可防止应用读取键盘事件。 当 GhosttyCN 检测到终端中的密码提示时会自动启用此功能；如果启用了 “GhosttyCN > 安全键盘输入”，则会始终启用。

source: Selected Text
zh_hans: 所选文本

source: Semicolon (;)
zh_hans: 分号 (;)

source: Send a mouse position event to the terminal. This reports the cursor position for mouse tracking.
zh_hans: 向终端发送鼠标位置事件，用于报告鼠标跟踪的光标位置。

source: Send a mouse scroll event to the terminal with configurable precision and momentum.
zh_hans: 向终端发送可配置精度和惯性的鼠标滚动事件。

source: Send Keyboard Event to Terminal
zh_hans: 向终端发送键盘事件

source: Send Mouse Button Event to Terminal
zh_hans: 向终端发送鼠标按钮事件

source: Send Mouse Position Event to Terminal
zh_hans: 向终端发送鼠标位置事件

source: Send Mouse Scroll Event to Terminal
zh_hans: 向终端发送鼠标滚动事件

source: Shift
zh_hans: Shift 键

source: Show
zh_hans: 显示

source: Simulate a keyboard event. This will not handle text encoding; use the 'Input Text' action for that.
zh_hans: 模拟键盘事件。此操作不会处理文本编码；如需输入文本，请使用“输入文本”操作。

source: Size:
zh_hans: 大小：

source: Skip
zh_hans: 跳过

source: Slash (/)
zh_hans: 斜杠 (/)

source: Something went fatally wrong. Check the logs and restart GhosttyCN.
zh_hans: 发生了严重错误。 请检查日志并重新启动 GhosttyCN。

source: Space
zh_hans: 空格键

source: Split Down
zh_hans: 向下分屏

source: Split Left
zh_hans: 向左分屏

source: Split Right
zh_hans: 向右分屏

source: Split Up
zh_hans: 向上分屏

source: Stationary
zh_hans: 静止

source: Tab
zh_hans: 标签页

source: Tab Color
zh_hans: 标签页颜色

source: Tabs are disabled
zh_hans: 标签页已停用

source: Tabs aren't supported in the Quick Terminal.
zh_hans: 快速终端不支持标签页。

source: Teal
zh_hans: 青色

source: Terminal
zh_hans: 终端

source: Terminal content area
zh_hans: 终端内容区域

source: Terminal Detail
zh_hans: 终端详细信息

source: Terminal Kind
zh_hans: 终端类型

source: Terminal Location
zh_hans: 终端位置

source: Terminal pane
zh_hans: 终端窗格

source: Terminal progress
zh_hans: 终端进度

source: Terminal progress - Error
zh_hans: 终端进度 - 错误

source: Terminal progress - In progress
zh_hans: 终端进度 - 正在进行

source: Terminal progress - Paused
zh_hans: 终端进度 - 已暂停

source: Terminal Read-only
zh_hans: 终端只读

source: Terminate
zh_hans: 终止

source: Terminate Processes
zh_hans: 终止进程

source: Text
zh_hans: 文本

source: The command to invoke.
zh_hans: 要调用的命令。

source: the default application
zh_hans: 默认应用

source: The detail to extract about a terminal.
zh_hans: 要从终端提取的详细信息。

source: The GhosttyCN app isn't properly initialized.
zh_hans: GhosttyCN 应用尚未正确初始化。

source: The horizontal position of the mouse cursor in pixels.
zh_hans: 鼠标光标的水平位置（像素）。

source: The horizontal scroll amount.
zh_hans: 水平滚动量。

source: The key to send to the terminal.
zh_hans: 要发送到终端的按键。

source: The keybind action to invoke. This can be any valid keybind action you could put in a configuration file.
zh_hans: 要调用的快捷键操作。可以是配置文件中可用的任何有效快捷键操作。

source: The local target does not exist or is not a regular file or directory.
zh_hans: 本地目标不存在，或者不是普通文件或目录。

source: The location that the terminal should be created.
zh_hans: 要创建终端的位置。

source: The modifiers to send with the key event.
zh_hans: 随按键事件发送的修饰键。

source: The modifiers to send with the mouse event.
zh_hans: 随鼠标事件发送的修饰键。

source: The modifiers to send with the mouse position event.
zh_hans: 随鼠标位置事件发送的修饰键。

source: The momentum phase for inertial scrolling.
zh_hans: 惯性滚动的惯性阶段。

source: The mouse button to press or release.
zh_hans: 要按下或松开的鼠标按钮。

source: The renderer has failed. This is usually due to exhausting available GPU memory. Please free up available resources.
zh_hans: 渲染器运行失败。这通常是可用 GPU 内存耗尽所致。请释放一些资源。

source: The target contains invisible or line-breaking characters.
zh_hans: 目标包含不可见字符或换行字符。

source: The target is not an absolute URL with a scheme.
zh_hans: 目标不是包含方案的绝对 URL。

source: The terminal failed to initialize. Please check the logs for more information. This is usually a bug.
zh_hans: 终端初始化失败。请检查日志以获取更多信息。这通常是程序错误。

source: The terminal no longer exists.
zh_hans: 该终端已不存在。

source: The terminal still has a running process. If you close the tab the process will be killed.
zh_hans: 终端中仍有进程在运行。关闭标签页将终止该进程。

source: The terminal still has a running process. If you close the terminal the process will be killed.
zh_hans: 终端中仍有进程在运行。关闭终端将终止该进程。

source: The terminal still has a running process. If you quit, the process will be killed.
zh_hans: 终端中仍有进程在运行。退出将终止该进程。

source: The terminal to base available commands from.
zh_hans: 用于确定可用命令的终端。

source: The terminal to close.
zh_hans: 要关闭的终端。

source: The terminal to extract information about.
zh_hans: 要提取信息的终端。

source: The terminal to focus.
zh_hans: 要聚焦的终端。

source: The terminal to inherit the base configuration from.
zh_hans: 要继承其基础配置的终端。

source: The terminal to invoke the action on.
zh_hans: 要在其中调用操作的终端。

source: The terminal to scope this action to.
zh_hans: 此操作适用的终端。

source: The text to input to the terminal. The text will be inputted as if it was pasted.
zh_hans: 要输入终端的文本。文本将以粘贴方式输入。

source: The update is ready. Please restart the application to complete the installation.
zh_hans: 更新已准备就绪。请重新启动应用以完成安装。

source: The update is ready. Version: %@
zh_hans: 更新已准备就绪。版本：%@

source: The vertical position of the mouse cursor in pixels.
zh_hans: 鼠标光标的垂直位置（像素）。

source: The vertical scroll amount.
zh_hans: 垂直滚动量。

source: The web target does not contain a valid host.
zh_hans: 网页目标不包含有效主机。

source: The working directory to open in the terminal.
zh_hans: 要在终端中打开的工作目录。

source: This link will open in %@. Only continue if you recognize and trust the destination.
zh_hans: 此链接将在 %@ 中打开。仅当你识别并信任目标时才继续。

source: This terminal is in read-only mode. You can still view, select, and scroll through the content, but no input events will be sent to the running application.
zh_hans: 本终端当前处于只读模式。你仍可浏览、选择、并滚动其中内容，但任何用户输入都不会传给运行中的程序。

source: Title
zh_hans: 标题

source: Toggle Terminal Inspector
zh_hans: 显示或隐藏终端检查器

source: Top pane
zh_hans: 上方窗格

source: Undo
zh_hans: 撤销

source: Undo %@
zh_hans: 撤销 %@

source: Unknown
zh_hans: 未知

source: Untitled
zh_hans: 未命名

source: Up Arrow
zh_hans: 上箭头键

source: Update Available
zh_hans: 有可用更新

source: Update Available: %@
zh_hans: 有可用更新：%@

source: Update Failed
zh_hans: 更新失败

source: Update GhosttyCN and Restart
zh_hans: 更新 GhosttyCN 并重新启动

source: Version
zh_hans: 版本

source: Version:
zh_hans: 版本：

source: Vertical split divider
zh_hans: 垂直分屏分隔条

source: Vertical split view
zh_hans: 垂直分屏视图

source: View GitHub Commit
zh_hans: 查看 GitHub 提交

source: View Release Notes
zh_hans: 查看发布说明

source: Visible Text
zh_hans: 可见文本

source: Volume Down
zh_hans: 降低音量键

source: Volume Mute
zh_hans: 静音键

source: Volume Up
zh_hans: 提高音量键

source: Warning: Potentially Unsafe Paste
zh_hans: 警告：粘贴内容可能不安全

source: Whether this is a high-precision scroll event (e.g., from trackpad).
zh_hans: 是否为高精度滚动事件（例如来自触控板）。

source: Whether to press or release the button.
zh_hans: 是按下还是松开按钮。

source: Window
zh_hans: 窗口

source: Working Directory
zh_hans: 工作目录

source: X Position
zh_hans: X 位置

source: X Scroll Delta
zh_hans: X 滚动增量

source: Y Position
zh_hans: Y 位置

source: Y Scroll Delta
zh_hans: Y 滚动增量

source: Yellow
zh_hans: 黄色

source: You are running the latest version
zh_hans: 你正在使用最新版本

source: You have %lld windows with running processes. Do you want to review these windows before quitting?
zh_hans: 有 %lld 个窗口仍有进程在运行。退出前要查看这些窗口吗？

source: You're already running the latest version.
zh_hans: 你已经在使用最新版本。

source: You're running a debug build of GhosttyCN! Performance will be degraded.
zh_hans: 你正在运行 GhosttyCN 的调试版本！性能会有所下降。
